IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/WWDT0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="WWDT0" HW_revision="1.0">
    <group id="WWDT0_GPRCM" name="WWDT0_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="WWDT0_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power
Note: For safety devices the power cannot be disabled once enabled." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="WWDT0_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear [GPRCM.STAT.RESETSTKY]" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral
Note: For safety devices a watchdog reset by software is not possible." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="WWDT0_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <register id="WWDT0_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
    </register>
    <group id="WWDT0_INT_EVENT" name="WWDT0_INT_EVENT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="WWDT0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Module Interrupt Vector Value.  This register provides the highest priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC." begin="4" end="0" width="5" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="INTTIM" value="0x1" description="Interval Timer Interrupt; Interrupt Flag: INTTIM; Interrupt Priority: Highest"/>
            </bitfield>
        </register>
        <register id="WWDT0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="INTTIM" description="Interval Timer Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="WWDT0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="INTTIM" description="Interval Timer Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="WWDT0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="INTTIM" description="Interval Timer Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="WWDT0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="INTTIM" description="Interval Timer Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="WWDT0_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="INTTIM" description="Interval Timer Interrupt." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
    </group>
    <register id="WWDT0_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="WWDT0_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="WWDT0_WWDTCTL0" width="32" offset="0x1100" description="Window Watchdog Timer Control Register 0">
        <bitfield id="PER" description="Timer Period of the WWDT. These bits select the total watchdog timer count." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="EN_25" value="0x0" description="Total timer count is 2^25"/>
            <bitenum id="EN_21" value="0x1" description="Total timer count is 2^21"/>
            <bitenum id="EN_18" value="0x2" description="Total timer count is 2^18"/>
            <bitenum id="EN_15" value="0x3" description="Total timer count is 2^15"/>
            <bitenum id="EN_12" value="0x4" description="Total timer count is 2^12 (default)"/>
            <bitenum id="EN_10" value="0x5" description="Total timer count is 2^10"/>
            <bitenum id="EN_8" value="0x6" description="Total timer count is 2^8"/>
            <bitenum id="EN_6" value="0x7" description="Total timer count is 2^6"/>
        </bitfield>
        <bitfield id="WINDOW0" description="Closed window period in percentage of the timer interval. WWDTCTL1.WINSEL determines the active window setting (WWDTCTL0.WINDOW0 or WWDTCTL0.WINDOW1)." begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="SIZE_0" value="0x0" description="0% (No closed Window)"/>
            <bitenum id="SIZE_12" value="0x1" description="12.50% of the total timer period is closed window"/>
            <bitenum id="SIZE_18" value="0x2" description="18.75% of the total timer period is closed window"/>
            <bitenum id="SIZE_25" value="0x3" description="25% of the total timer period is closed window"/>
            <bitenum id="SIZE_50" value="0x4" description="50% of the total timer period is closed window"/>
            <bitenum id="SIZE_75" value="0x5" description="75% of the total timer period is closed window"/>
            <bitenum id="SIZE_81" value="0x6" description="81.25% of the total timer period is closed window"/>
            <bitenum id="SIZE_87" value="0x7" description="87.50% of the total timer period is closed window"/>
        </bitfield>
        <bitfield id="MODE" description="Window Watchdog Timer Mode" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="WINDOW" value="0x0" description="Window Watchdog Timer Mode. The WWDT will generate a error signal to the ESM when following conditions occur: - Timer Expiration (Timeout) - Reset WWDT during the active window closed period - Keyword violation"/>
            <bitenum id="INTERVAL" value="0x1" description="Interval Timer Mode. The WWDT acts as an interval timer. It generates an interrupt on timeout."/>
        </bitfield>
        <bitfield id="STISM" description="Stop In Sleep Mode.   
The functionality of this bit requires that POLICY.HWCEN = 0. If POLICY.HWCEN = 1 the WWDT resets during sleep and needs re-configuration.
Note: This bit has no effect for the global Window Watchdog as Sleep Mode is not supported." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CONT" value="0x0" description="The WWDT continues to function in Sleep mode."/>
            <bitenum id="STOP" value="0x1" description="The WWDT stops in Sleep mode and resumes where it was stopped after wakeup."/>
        </bitfield>
        <bitfield id="CLKDIV" description="Module Clock Divider, Divide the clock source by CLKDIV+1.
Divider values from /1 to /8 are possible.
The clock divider is currently 4 bits. Bit 4 has no effect and should always be written with 0." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x7" description="Maximum value"/>
        </bitfield>
        <bitfield id="WINDOW1" description="Closed window period in percentage of the timer interval. WWDTCTL1.WINSEL determines the active window setting (WWDTCTL0.WINDOW0 or WWDTCTL0.WINDOW1)." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="SIZE_0" value="0x0" description="0% (No closed Window)"/>
            <bitenum id="SIZE_12" value="0x1" description="12.50% of the total timer period is closed window"/>
            <bitenum id="SIZE_18" value="0x2" description="18.75% of the total timer period is closed window"/>
            <bitenum id="SIZE_25" value="0x3" description="25% of the total timer period is closed window"/>
            <bitenum id="SIZE_50" value="0x4" description="50% of the total timer period is closed window"/>
            <bitenum id="SIZE_75" value="0x5" description="75% of the total timer period is closed window"/>
            <bitenum id="SIZE_81" value="0x6" description="81.25% of the total timer period is closed window"/>
            <bitenum id="SIZE_87" value="0x7" description="87.50% of the total timer period is closed window"/>
        </bitfield>
    </register>
    <register id="WWDT0_WWDTCTL1" width="32" offset="0x1104" description="Window Watchdog Timer Control Register 0">
        <bitfield id="WINSEL" description="Close Window Select" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="WIN0" value="0x0" description="In window mode field WINDOW0 of WDDTCTL0 defines the closed window size. In interval mode field WINDOW0 defines the timeout interval."/>
            <bitenum id="WIN1" value="0x1" description="In window mode field WINDOW1 of WDDTCTL0 defines the closed window size. In interval mode field WINDOW1 defines the timeout interval."/>
        </bitfield>
    </register>
    <register id="WWDT0_WWDTCNTRST" width="32" offset="0x1108" description="Window Watchdog Timer Counter Reset Register">
        <bitfield id="RESTART" description="Window Watchdog Timer Counter Restart Writing 00A7h to this register restarts the WWDT Counter. 
Writing any other value causes an error generation to the ESM.
Read as 0." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="WWDT0_WWDTSTAT" width="32" offset="0x110C" description="Window Watchdog Timer Status Register">
        <bitfield id="RUN" description="Watchdog running status flag." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="OFF" value="0x0" description="Watchdog counter stopped."/>
            <bitenum id="ON" value="0x1" description="Watchdog running."/>
        </bitfield>
    </register>
</module>
